using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ClassesAndObjectsTask1
{
    class Point
    {
        // Поля
        int x, y;

        // Конструктор, позволяющий создать экземпляр класса с нулевыми координатами.

        // Конструктор, позволяющий создать экземпляр класса с заданными координатами.

        // Метод, выводящий координаты точки на экран.

        // Метод, расчитывающий расстояние от начала координат до точки.

        // Метод, перемещающий точку на плоскости на вектор (a, b).

        // Свойство, позволяющее получить-установить координаты точки (доступные для чтения и записи).

        // Свойство, позволяющее умножить координаты точки на скаляр (доступное только для записи).

        // Индексатор, позволяющий по индексу 0 обращаться к полю x, по индексу 1 - к полю y, 
        // при других значениях индекса выдается сообщение об ошибке.

        // Перегрузка операции ++: одновременно увеличивает значение полей x и y на 1.

        // Перегрузка операции --: одновременно уменьшает значение полей x и y на 1.

        // Перегрузка констант true и false: 
        // обращение к экземпляру класса дает значение true, если значение полей x и y совпадает, иначе false.

        // Перегрузка операции бинарный +: одновременно добавляет к полям x и y значение скаляра.
    }
}
